<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#DataFrame" data-toc-modified-id="DataFrame-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>DataFrame</a></span><ul class="toc-item"><li><span><a href="#Create-DataFrame" data-toc-modified-id="Create-DataFrame-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Create DataFrame</a></span><ul class="toc-item"><li><span><a href="#Dict" data-toc-modified-id="Dict-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>Dict</a></span></li><li><span><a href="#Dict-in-Dict" data-toc-modified-id="Dict-in-Dict-2.1.2"><span class="toc-item-num">2.1.2&nbsp;&nbsp;</span>Dict in Dict</a></span></li></ul></li></ul></li></ul></div>

In [1]:
%matplotlib inline
import matplotlib.pyplot as plt

import os
import numpy as np
import pandas as pd
from datetime import datetime
import time

import warnings
warnings.filterwarnings('ignore')
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

---

## Series

In [10]:
obj1 = pd.Series([4, 3, 5, 1])
obj1

print('='*20)
obj2 = pd.Series([4, 3, 5, 1], index=['a', 'b', 'c', 'd'])
obj2

0    4
1    3
2    5
3    1
dtype: int64

====================

a    4
b    3
c    5
d    1
dtype: int64

In [15]:
dataDict = {'a': 1, 'b': 2, 'c': 3}
obj1 = pd.Series(dataDict)
obj1

print('='*20)
dataIndex = ['d', 'c', 'b']
obj2 = pd.Series(dataDict, index=dataIndex)
obj2.name = 'Test'
obj2.index.name = 'Index'

obj2

print('='*20)
obj2.isnull()
obj2.notnull()

a    1
b    2
c    3
dtype: int64

====================

Index
d    NaN
c    3.0
b    2.0
Name: Test, dtype: float64

====================

Index
d     True
c    False
b    False
Name: Test, dtype: bool

Index
d    False
c     True
b     True
Name: Test, dtype: bool

## DataFrame

### Create DataFrame

#### Dict

In [21]:
# dict
# Key = Column, Value = Data
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

df1 = pd.DataFrame(data)
df1
print('='*20)

df2 = pd.DataFrame(data,
                   columns=['year', 'state', 'pop', 'debt'],
                   index=['a', 'b', 'c', 'd', 'e', 'f'])
df2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

====================

   year   state  pop debt
a  2000    Ohio  1.5  NaN
b  2001    Ohio  1.7  NaN
c  2002    Ohio  3.6  NaN
d  2001  Nevada  2.4  NaN
e  2002  Nevada  2.9  NaN
f  2003  Nevada  3.2  NaN

In [24]:
df3 = df2.copy()
df3.debt = 16.5
df3
print('='*20)

df4 = df2.copy()
val = pd.Series([15, 16, 17], index=['a', 'c', 'd'])
df4.debt = val
df4

   year   state  pop  debt
a  2000    Ohio  1.5  16.5
b  2001    Ohio  1.7  16.5
c  2002    Ohio  3.6  16.5
d  2001  Nevada  2.4  16.5
e  2002  Nevada  2.9  16.5
f  2003  Nevada  3.2  16.5

====================

   year   state  pop  debt
a  2000    Ohio  1.5  15.0
b  2001    Ohio  1.7   NaN
c  2002    Ohio  3.6  16.0
d  2001  Nevada  2.4  17.0
e  2002  Nevada  2.9   NaN
f  2003  Nevada  3.2   NaN

In [26]:
df3 = df2.copy()
df3['eastern'] = df3.state == 'Ohio'
df3

   year   state  pop debt  eastern
a  2000    Ohio  1.5  NaN     True
b  2001    Ohio  1.7  NaN     True
c  2002    Ohio  3.6  NaN     True
d  2001  Nevada  2.4  NaN    False
e  2002  Nevada  2.9  NaN    False
f  2003  Nevada  3.2  NaN    False

#### Dict in Dict

In [28]:
# KEY = Columns, key = row index
data = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
df = pd.DataFrame(data)
df
print('='*20)

df.T

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

====================

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5